# Date: 2023/2/28 上午9:07
# 必选参数、默认参数【缺省参数】、可选参数、关键字参数
# 1、必选参数
print('-------------------1、必选参数---------------------')


def sum(a, b):  # a,b:形式参数，形参只是意义上的一种参数，在定义的时候是不占内存地址的
    sum = a + b
    print(sum)


sum(1, 2)  # 1,2:实际参数，实参是实在的参数，是实际占用内存地址的

# 默认参数，始终存在于参数列表中的尾部
print('-------------------2、默认参数---------------------')


def sum1(a=10, b=20):
    print(f'默认参数的使用:{a + b}')


sum1(100)

# 可变参数：当参数的个数不确定时使用，比较灵活
print('-------------------3、可选参数---------------------')


def getComputer(*args):
    '''
    *args:可变长的参数类型
    '''
    print(args)


getComputer(1, 2, 3, 4, 5, 6, 'lv', [1, 23, 4], range(10), (5, 6, 7))

# 参数关键字是一个字典类型
print('-------------------4、关键字参数---------------------')


def keyFunc(**args):
    print(args)


d = {'name': 'lv', 'age': 19}
keyFunc(**d)
keyFunc(name='peter', age=90)
keyFunc()
