# Date: 2023/3/15 上午11:19
'''
匹配手机号码：
移动号码段：139、138、137、136、135、134、150、151、152、157、158、159、182、183、187、188、147
联通号码段：130、131、132、136、185、186、145
电信号码段：133、153、180、189
'''

import re

yidong = re.compile('(139|138|137|136|135|134|150|151|152|157|158|159|182|183|187|188|147)[0-9]{8}')
liantong = re.compile('(130|131|132|136|185|186|145)[0-9]{8}')
dianxin = re.compile('(133|153|180|189)[0-9]{8}')

tel = input('请输入你的电话号码：')
if yidong.match(tel):
    print('您的手机是移动号码')
elif liantong.match(tel):
    print('您的手机是联通号码')
elif dianxin.match(tel):
    print('您的手机上电信号码')
else:
    print('手机号有误，请重新输入')
